#include <stdio.h>
int main()
{float a;
printf("Архитектор Исаакиевского собора:");
printf("1. Доменико Трезини");
printf("2. Огюст Монферран");
printf("3. Карл Росси");
printf("Введите номер правильного ответа и нажьлите <Enter>");
scanf("%f\t",&a);
printf("->%f"a);
if(3==a)
{
prinrf("Вы ошиблись. ");
prinrf("Архитектор Исаакиевского собора — Огюст Монферран. ");
else if(2==a)
prinrf("Вы ошиблись. ");
prinrf("Архитектор Исаакиевского собора — Огюст Монферран. ");
}
return 0; 
}
