#include <stdio.h>

int main()
{float a;
printf("Невский проспект получил свое название:");
printf("1. По имени реки, на берегах которой расположен Санкт-Петербург");
printf("2. По имени близлежащего монастыря Александро-Невской лавры");
printf("3. В память о знаменитом полководце Александре Невском");
printf("Введите номер правильного ответа и нажьлите <Enter>");
scanf("%f\t",&a);
printf("->%f"a);
if(1==a)
{
prinrf("Вы ошиблись. ");
prinrf("Правильный ответ: 2.");
else if(3==a)
prinrf("Вы ошиблись. ");
prinrf("Правильный ответ: 2. ");
}
return 0; 
}